<template>
    <div class="page">
        <Header />
        <div class="page__content">
            <section class="FAQ-section">
                <div class="container">
                    <h1 class="FAQ-section__title title">Часто задаваемые вопросы</h1>
                    
                    <h2 class="title">Какие мероприятия проводятся в Доме культуры?</h2>
                    <p>Мы проводим концерты, спектакли, мастер-классы, выставки, фестивали, 
                        кружки для детей и взрослых, а также праздничные мероприятия, посвящённые государственным и городским датам.</p>
                    

                    <h2 class="title">Есть ли у вас кружки для детей?</h2>
                    <p>Да, у нас работает множество кружков и студий для детей: хореография, 
                        вокал, театр, изобразительное искусство и другие. Ознакомиться с полным списком и 
                        записаться можно в разделе «Творческие группы».</p>

                    <h2 class="title">Как записаться в кружок?</h2>
                    <p>Запись осуществляется через онлайн-форму на сайте или по телефону, указанному в карточке кружка. 
                        Также вы можете прийти лично в администрацию Дома культуры.</p>

                    <h2 class="title">Работает ли у вас буфет или кафе?</h2>
                    <p>В дни мероприятий работает буфет, где можно приобрести напитки и лёгкие закуски.</p>
                </div>
            </section>
        </div>
        <Footer />
    </div>
 
</template>

<script setup>
    import Header from '@/components/Header.vue'
    import Footer from '@/components/Footer.vue'
</script>

<style lang="sass" scoped>
@import '@/assets/style.sass'
</style>